<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<link rel="stylesheet" href="default.css" type="text/css" />
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body>
<table border="0" width="100%" cellspacing="0" cellpadding="3">
<tr><td class="_podblock_" valign="middle">
<big><strong><span class="_podblock_">&nbsp;</span></strong></big>
</td></tr>
</table>



<h2 id="Projekt-baserat-p-Raspberry-Pi">Projekt baserat p&aring; Raspberry Pi</h2>

<h3 id="Picam-live">Picam live!</h3>

<p>picam kan ses live p&aring; <a href="http://twitter.com/wantarray">http://twitter.com/wantarray</a>.</p>

<h1 id="PiCAM">PiCAM</h1>

<p>Jag har valt att inhandla en kameramodul till min Pi och bygga in den i chassit.</p>

<p>Redan fr&aring;n b&ouml;rjan hade jag en tanke om att det vore h&auml;ftigt att bygga en twitter-uppkopplad ultraportabel kamerarobot. Jag var inte s&auml;ker p&aring; om jag skulle komma hela v&auml;gen, men det har jag gjort.</p>

<p>Komponenter som anv&auml;nds f&ouml;r detta bygge:</p>

<pre><code>    Raspberry Pi 3
    Pi camera module v2
    Perl
    Shell script
    Imagemagick</code></pre>

<p>Jag har anv&auml;nt Perl till s&aring; mycket som m&ouml;jligt. Denna html-sida &auml;r skriven i markup-spr&aring;ket <b>pod</b> (Plain Old Documentation) och genererad till html med hj&auml;lp av <b>pod2html</b>.</p>

<pre><code>    $ pod2html --no-index --header -css doc/default.css picam_twitter.pl &gt; picam_twitter.pod</code></pre>

<p>D&auml;rf&ouml;r ber jag dig att inte l&auml;sa den r&aring;a html-filen, den ser ut som skr&auml;p.</p>

<p>CSS-filen har jag skrivit f&ouml;r hand.</p>

<p>Steg f&ouml;r steg-instruktioner f&ouml;r att s&auml;tta upp picam och hj&auml;lpscriptet pisnap som tar sj&auml;lva bilderna:</p>

<p>B&ouml;rja med att installera <b>cpanminus</b>. Det &auml;r inget krav, men det &auml;r s&aring; mycket b&auml;ttre &auml;n cpan. Bin&auml;ren cpan(m) anv&auml;nds f&ouml;r att installera perlmoduler, eller bibliotek. fr&aring;n Comprehensive Perl Archive Network. N&auml;r vi &auml;nd&aring; h&aring;ller p&aring; s&aring; kan vi installera <b>Imagemagick</b> som anv&auml;nds f&ouml;r att justera storleken p&aring; tagen bild s&aring; att vi inte &ouml;verskrider twitters max-storlek.</p>

<pre><code>    # apt-get install cpanminus imagemagick</code></pre>

<p>N&auml;r installationen &auml;r klar skall vi konfiguera s&aring; att bibliotek kan installeras av en vanlig anv&auml;ndare, i dennes hemkatalog. Detta &auml;r inte heller n&aring;got krav, men kan vara bra om man inte har tillg&aring;ng till root eller om man inte vill installera saker system-wide.</p>

<p>&Ouml;ppna din shellrc med valfri editor:</p>

<pre><code>    $ vim ~./zshrc</code></pre>

<p>L&auml;gg till f&ouml;ljande rader (f&ouml;rslagsvis l&auml;ngst ned i filen):</p>

<pre><code>    PERL5LIB=&quot;$HOME/perl5/lib/perl5${PERL5LIB:+:${PERL5LIB}}&quot;; export PERL5LIB;
    PERL_LOCAL_LIB_ROOT=&quot;$HOME/perl5${PERL_LOCAL_LIB_ROOT:+:${PERL_LOCAL_LIB_ROOT}}&quot;; export PERL_LOCAL_LIB_ROOT;
    PERL_MB_OPT=&quot;--install_base \&quot;$HOME/perl5\&quot;&quot;; export PERL_MB_OPT;
    PERL_MM_OPT=&quot;INSTALL_BASE=$HOME/perl5&quot;; export PERL_MM_OPT;</code></pre>

<p>Spara, och re-sourca filen (eller starta ett nytt skal).</p>

<p>Se till att katalogen d&auml;r modulerna skall installeras existerar:</p>

<pre><code>    $ mkdir -p ~/perl5/lib</code></pre>

<p>Nu kan vi installera de bibliotek som picam beror p&aring;. Notera att det d&aring; skall g&ouml;ras som din vanliga anv&auml;ndare!</p>

<pre><code>    $ cpanm Net::Twitter</code></pre>

<p>N&auml;r installationen &auml;r klar s&aring; kommer <b>~/perl5/lib/perl5/Net/Twitter</b> vara populerad.</p>

<p>F&ouml;r att kunna posta p&aring; twitter s&aring; beh&ouml;vs ett antal API-nycklar. Dessa nycklar f&aring;r man tillg&aring;ng till genom att ans&ouml;ka om utvecklarstatus, och det tar bara n&aring;gon minut. F&ouml;r att v&aring;rt program sedan skall kunna ta del av dessa nycklar s&aring; beh&ouml;ver de (exempelvis) exporteras i din shellrc.</p>

<p>Allts&aring;:</p>

<pre><code>    export TWITTER_ACCESS_SECRET=&#39;&lt;secret&gt;&#39;
    export TWITTER_CONSUMER_SECRET=&#39;&lt;secret&gt;&#39;
    export TWITTER_ACCESS_TOKEN=&#39;&lt;token&gt;&#39;
    export TWITTER_CONSUMER_KEY=&#39;&lt;key&gt;&#39;</code></pre>

<p>Spara och re-sourca shellrc.</p>

<p><b>pisnap</b> tar en bild med hj&auml;lp av raspistill. Eftersom utrymmet p&aring; Pi &auml;r begr&auml;nsat har jag valt att skicka filen till min server i sambons garderob. Den lokala filen tas sedan bort. H&auml;r kommer du att beh&ouml;va editera:</p>

<pre><code>               USER=&#39;scp1&#39;
               HOST=&#39;laleh&#39;
    SAVE_DIR_REMOTE=&#39;_picam&#39;</code></pre>

<p>Alternativt kommentera ut de ssh-specifika raderna.</p>

<p>------------------</p>

<p>Nu &auml;r mjukvarusidan av konfigurationen (n&auml;stan) klar. Jag har tagit f&ouml;r givet att du redan har installerat kameramodulen i din Pi, och det enda som d&aring; beh&ouml;ver g&ouml;ras &auml;r att faktiskt tala om f&ouml;r v&aring;r Pi att vi vill anv&auml;nda den.</p>

<p>K&ouml;r, som root:</p>

<pre><code>    # raspi-config</code></pre>

<p>Under <b>Interfacing options</b>, v&auml;lj <b>Enable Raspberry Pi Camera</b>. Spara och avsluta. Det som nu sker &auml;r bland annat att <b>raspistill</b> installeras, den bin&auml;r pisnap anv&auml;nder f&ouml;r att ta sj&auml;lva bilderna.</p>

<h1 id="Funktionalitet">Funktionalitet</h1>

<h2 id="Hjlpscript">Hj&auml;lpscript</h2>

<p>Jag har skrivit ett antal hj&auml;lpskript som arbetar tillsammans med picam.</p>

<h3 id="bin-pi_status">bin/pi_status</h3>

<p>pi_status &auml;r ett shellscript som levererar data f&ouml;r picam att anv&auml;nda som statusuppdatering p&aring; twitter om ingen egen status har specificerats med flaggan -t till picam. I nul&auml;get &auml;r det min Pi:s uptime och aktuell timtemperatur i Karlstad som genereras.</p>

<h3 id="pisnap">pisnap</h3>

<p>pi_snap g&ouml;r flera intressanta saker, i en evig loop. Ett kort tas med kameran med hj&auml;lp av raspistill. Denna bild skickas till min privata server, och en kopia av det senaste tagna fotot kopieras till filen <b>latest.jpg</b>. Originalfilen tas bort fr&aring;n Pi, s&aring; att det alltid enbart kommer att finnas en bildfil lokalt (den senast tagna).</p>

<p>Kopian justeras i storlek f&ouml;r uppladdning p&aring; twitter, med hj&auml;lp av <b>convert</b> fr&aring;n imagemagick.</p>

<p>pisnap har en sleep-interval p&aring; 1730 sekunder. Detta f&ouml;r att sj&auml;lva picam har en sleep-interval p&aring; 1800 sekunder - f&ouml;r att vara s&auml;ker p&aring; att pisnap hinner med alla uppgifter, &auml;ven under tung belastning, innan picam s&auml;tter ig&aring;ng sin n&auml;sta loop. Annars finns det en liten risk att det &auml;r den n&auml;st senaste tagna bilden som kommer att laddas upp p&aring; twitter.</p>

<h1 id="picam">picam</h1>

<p>Picam kan ta emot ett antal flaggor.</p>

<pre><code>    -t,  --tweet      tweeta senast tagna bild med &ouml;nskad status som argument
    -d,  --daemonize  k&ouml;r picam som en daemon, dvs i bakgrunden
    -h,  --help       visa hj&auml;lpen och avsluta
    -v,  --version    visa version och avsluta</code></pre>

<p>Picam twittrar live p&aring; <a href="http://twitter.com/wantarray">http://twitter.com/wantarray</a>.</p>

<p>K&auml;llkoden f&ouml;r picam och samtliga filer i detta projekt &aring;terfinns p&aring; <a href="https://github.com/trapd00r/picam">https://github.com/trapd00r/picam</a></p>

<h1 id="POD-ERRORS">POD ERRORS</h1>

<p>Hey! <b>The above document had some coding errors, which are explained below:</b></p>

<dl>

<dt id="Around-line-3">Around line 3:</dt>
<dd>

<p>Non-ASCII character seen before =encoding in &#39;p&aring;&#39;. Assuming UTF-8</p>

</dd>
</dl>

<table border="0" width="100%" cellspacing="0" cellpadding="3">
<tr><td class="_podblock_" valign="middle">
<big><strong><span class="_podblock_">&nbsp;</span></strong></big>
</td></tr>
</table>

</body>

</html>


